atmosphere/tutorials/ce3/currentT100/0/ph_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ph_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    top
    {
       type        fixedFluxPressure;
       value       $internalField;

    }
    bottom
    {
       type        fixedFluxPressure;
       value       $internalField;


    }
    left
    {
       type        fixedFluxPressure;
       value       $internalField;

    }
    right

    {
       type        fixedFluxPressure;
       value       $internalField;

    }
    frontandback
    {
        type       empty;
    }
}


// ************************************************************************* //
