atmosphere/tutorials/ce3/currentT100/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
   top
    {
         type            calculated;
         value           $internalField;
    }
    bottom
    {
         type            calculated;
         value           $internalField;
    }
    left
    {
         type            calculated;
         value           $internalField;
    }
    right
    {
         type            calculated;
         value           $internalField;
    }
    frontAndBack
    {
         type            empty;
    }
}


// ************************************************************************* //
