atmosphere/tutorials/ce3/currentT100/0/rho0
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      rho0;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
8192
(
1.14926
1.14926
1.14926
1.14926
1.14926
1.14926
1.14926
1.14926
...
)
;

boundaryField
{
    top
    {
        type            calculated;
        value           uniform 0.647828;
    }
    bottom
    {
        type            calculated;
        value           uniform 1.15862;
    }
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.14926
1.13069
1.11229
1.09407
1.07602
1.05816
1.04048
1.02297
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
32
(
1.14926
1.13069
1.11229
1.09407
1.07602
1.05816
1.04048
1.02297
...
)
;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
